Linux体系结构
============

在我之前的文章中，我已经给大家简要的介绍了Linux操作系统，我们讨论了关于它的很多方面，包括什么是Linux，Linux如何普及，Linux的特点以及各种不同的Linux发行版和软件。在这篇文章中，我们将进行更加深入的探讨，将探讨在整个Linux系统结构基础之上的基本架构。

![Alt text](http://i2.wp.com/oceanofwebs.com/wp-content/uploads/2013/05/Architecture-and-Organisation-Linux.jpg)

如果你想在Android或者Linux上开发一款能直接与系统程序库通信的软件，那么了解Linux的体系结构就是非常有必要的。

##Linux体系结构

操作系统的体系结构一般分为两部分:

1. 内核模式
2. 用户模式

- ###内核模式
它能运行系统进程
- ###用户模式
它能运行像MS word，MS paint那样的程序。一个系统可以通过系统调用从用户模式进入内核模式。这是很重要的内核模式通过生成一个进程去支持用户模式。
  
操作系统体系结构的5个组成部分：
1. 内核
2. Shell
3. 系统工具
4. 用户应用
5. 硬件平台

![Alt text](http://i1.wp.com/oceanofwebs.com/wp-content/uploads/2013/05/Architure-of-Linus-Operating-System.jpg)

- ###什么是内核?
内核在操作系统和硬件资源之间扮演了接口的角色。它是操作系统的主要组成部分，并且在系统启动时，它会首先被加载，并一直运行在主存储器中。它也是连接应用程序和支撑应用程序的数据的桥梁。同时，它还负责任务管理，内存管理和磁盘管理。它的主要功能是管理计算机资源，并为想要使用这些资源的程序提供支持。
- ###什么是Shell？
Shell在用户和操作系统之间扮演了接口的角色。它为那些需要使用系统中内核服务的用户提供了一个借口。Shell通常由以下两部分组成：
- ####命令行
它是操作系统的一部分，主要负责接受和执行用户提交的操作系统命令。这些命令被传输到内核中执行，如果命令式有效的则将其执行，否则报错。
- ####图形用户界面
它提供了一个用户友好的环境。由于用户无法记住所有命令的语法，因此它通过鼠标或者其他点击设备来帮助用户通过简单的点击去完成需要的操作。
- ####内核和Shell之间的互联
当用户向Shell发出执行执行操作请求的命令时，Shell会将这些语句翻译成机器语言，然后传递给内核。内核收到来自Shell的请求后，就会处理这些请求并将结果显示在屏幕上。所有的这些功能都是内核通过一种透明的方式进行。
- ###什么是系统工具？
系统工具由各种系统中断和系统调用组成。这个控制可以通过使用系统调用来转移。

**系统调用**

系统调用在进程和操作系统之间扮演了接口的角色。简而言之，系统调用就是根据用户的请求运行任何请求或执行任何操作。

例：一个用户请求使用MS Paint。首先，这个请求将被传给操作系统，然后操作系统将生成一些活动来支持MS paint使其运行在系统上。

**系统调用的种类**

1. 文件系统管理的系统调用：打开文件，关闭文件，读写文件等操作。
2. 进程控制的系统调用：过载进程，执行进程，创建进程等操作。
3. 设备管理的系统调用：申请设备，释放设备，设备I/O和重定向等操作。
4. 通信的系统调用：发送消息，转移状态等操作。


- ###用户应用程序
这些是用户需要完成某些任务的程序。Linux和其他操作系统一样提供了大量的应用程序像g++，gcc，office suits等。内核被用来生成进程去支持这些应用。
- ###硬件平台
众所周知，硬件平台包括像键盘，显示器，打印机等一系列存在用户输入输出请求的设备。
